CSI API ETABS v1
cPropArea.GetWall Method
 Retrieves property data for a wall section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetWall(
	string Name,
	ref eWallPropType WallPropType,
	ref eShellType ShellType,
	ref string MatProp,
	ref double Thickness,
	ref int color,
	ref string notes,
	ref string GUID
)
Function GetWall (
	Name As String,
	ByRef WallPropType As eWallPropType,
	ByRef ShellType As eShellType,
	ByRef MatProp As String,
	ByRef Thickness As Double,
	ByRef color As Integer,
	ByRef notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim WallPropType As eWallPropType
Dim ShellType As eShellType
Dim MatProp As String
Dim Thickness As Double
Dim color As Integer
Dim notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetWall(Name, WallPropType,
	ShellType, MatProp, Thickness, color,
	notes, GUID)
int GetWall(
	String^ Name,
	eWallPropType% WallPropType,
	eShellType% ShellType,
	String^% MatProp,
	double% Thickness,
	int% color,
	String^% notes,
	String^% GUID
)
abstract GetWall :
        Name : string *
        WallPropType : eWallPropType byref *
        ShellType : eShellType byref *
        MatProp : string byref *
        Thickness : float byref *
        color : int byref *
        notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing wall property.
WallPropType
Type: ETABSv1.eWallPropType
 This is one of the items in the eWallPropType enumeration.
 If this item is AutoSelectList, use the GetWallAutoSelectList(String, String[], String) function to get additional parameters.
ShellType
Type: ETABSv1.eShellType
 This is one of the items in the eShellType enumeration.
MatProp
Type: System.String
 The name of the material property for the area property.
 This item does not apply when ShellType is Layered.
Thickness
Type: System.Double
 The membrane thickness. [L]
 This item does not apply when ShellType is Layered.
color
Type: System.Int32
The display color assigned to the property.
notes
Type: System.String
The notes, if any, assigned to the property.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
 The function returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim WallPropType As eWallPropType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
    'set new area property
       ret = SapModel.PropArea.SetWall("MyShellProp1A", eWallPropType.Specified, eShellType.ShellThin, "4000Psi", 14.2)
    'get area property data
       ret = SapModel.PropArea.GetWall("MyShellProp1A", WallPropType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace